{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "emb_size": 312,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "O",
    "1": "B-TYPE",
    "2": "I-TYPE",
    "3": "B-BRAND",
    "4": "I-BRAND",
    "5": "B-VOLUME",
    "6": "I-VOLUME",
    "7": "B-PERCENT",
    "8": "I-PERCENT"
  },
  "initializer_range": 0.02,
  "intermediate_size": 600,
  "label2id": {
    "B-BRAND": 3,
    "B-PERCENT": 7,
    "B-TYPE": 1,
    "B-VOLUME": 5,
    "I-BRAND": 4,
    "I-PERCENT": 8,
    "I-TYPE": 2,
    "I-VOLUME": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 2048,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 3,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.56.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 83828
}
